maloneyl/w3d1/classwork/my_first_rails_app/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("created_at", "post_id", "text", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 14 Oct 2013 13:15:07 UTC +00:00], ["post_id", 2], ["text", "This is another comment, yo."], ["updated_at", Mon, 14 Oct 2013 13:15:07 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.save