maloneyl/w3d1/classwork/my_first_rails_app/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "text" = 'Bacon ipsum dolor sit amet meatloaf pastrami ball tip, rump filet mignon pork belly sirloin swine corned beef shankle bresaola cow tenderloin tri-tip. Ribeye pastrami fatback, brisket beef t-bone pork chop kevin tail venison salami. Prosciutto swine fatback andouille. Salami meatloaf capicola frankfurter. Short ribs corned beef t-bone, doner prosciutto rump pork chop shoulder. Beef ribs jerky boudin, doner tail chicken pork chop.